arielivandiaz/STM32F4-Systick/main.c
/**
  ******************************************************************************

  * @author  Ariel Ivan Diaz
  * @version V1.0.2
  * @date    August-2014
  * @brief   Imperial March
  ******************************************************************************


  ******************************************************************************
  */

//Notes using ARDUNOTES - SOURCE: http://tny.cz/d1a629c1
#define	C0 16.35
#define	Db0	17.32
#define	D0	18.35
#define	Eb0	19.45
#define	E0	20.60
#define	F0	21.83
#define	Gb0	23.12
#define	G0	24.50
#define	Ab0	25.96
#define	LA0	27.50
#define	Bb0	29.14
#define	B0	30.87
#define	C1	32.70
#define	Db1	34.65
#define	D1	36.71
#define	Eb1	38.89
#define	E1	41.20
#define	F1	43.65
#define	Gb1	46.25
#define	G1	49.00
#define	Ab1	51.91
#define	LA1	55.00
#define	Bb1	58.27
#define	B1	61.74
#define	C2	65.41
#define	Db2	69.30
#define	D2	73.42
#define	Eb2	77.78
#define	E2	82.41
#define	F2	87.31
#define	Gb2	92.50
#define	G2	98.00
#define	Ab2	103.83
#define	LA2	110.00
#define	Bb2	116.54
#define	B2	123.47
#define	C3	130.81
#define	Db3	138.59
#define	D3	146.83
#define	Eb3	155.56
#define	E3	164.81
#define	F3	174.61
#define	Gb3	185.00
#define	G3	196.00
#define	Ab3	207.65
#define	LA3	220.00
#define	Bb3	233.08
#define	B3	246.94
#define	C4	261.63
#define	Db4	277.18
#define	D4	293.66
#define	Eb4	311.13
#define	E4	329.63
#define	F4	349.23
#define	Gb4	369.99
#define	G4	392.00
#define	Ab4	415.30
#define	LA4	440.00
#define	Bb4	466.16
#define	B4	493.88
#define	C5	523.25
#define	Db5	554.37
#define	D5	587.33
#define	Eb5	622.25
#define	E5	659.26
#define	F5	698.46
#define	Gb5	739.99
#define	G5	783.99
#define	Ab5	830.61
#define	LA5	880.00
#define	Bb5	932.33
#define	B5	987.77
#define	C6	1046.50
#define	Db6	1108.73
#define	D6	1174.66
#define	Eb6	1244.51
#define	E6	1318.51
#define	F6	1396.91
#define	Gb6	1479.98
#define	G6	1567.98
#define	Ab6	1661.22
#define	LA6	1760.00
#define	Bb6	1864.66
#define	B6	1975.53
#define	C7	2093.00
#define	Db7	2217.46
#define	D7	2349.32
#define	Eb7	2489.02
#define	E7	2637.02
#define	F7	2793.83
#define	Gb7	2959.96
#define	G7	3135.96
#define	Ab7	3322.44
#define	LA7	3520.01
#define	Bb7	3729.31
#define	B7	3951.07
#define	C8	4186.01
#define	Db8	4434.92
#define	D8	4698.64
#define	Eb8	4978.03
// DURATION OF THE NOTES
#define BPM 120    //  you can change this value changing all the others/*
#define QQ	 500//60000/BPM //quarter 1/4
#define H 1000 //half 2/4
#define E 250   //eighth 1/8
#define S 125 // sixteenth 1/16
#define W 2000 // whole 4/4             */
/* Includes ------------------------------------------------------------------*/





#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"



uint32_t time_ms = 0;


static __IO uint32_t TimingDelay;

/* Private function prototypes -----------------------------------------------*/
static void Delay(__IO uint32_t nTime);

void play_tone(double frecuency, unsigned int duration);

void PORT_Init(void);



int main(void)
	{

	SystemInit(); //Inite systems
	PORT_Init();  //Init port and pins


	// Clock config example:
	// HCLK= 168MHz
	// Requerimiento= 1 mseg
	// 		1seg --- 168 Mticks
	// 		1ms ---- x
	// 		x = 168.000 ticks
	SysTick_Config(SystemCoreClock / 10000); //Reloj en uSg




    while(1)
    {


    	 play_tone(LA3,QQ);
    	    Delay(1+QQ); //Delay duration should always be 1 ms more than the note in order to separate them.
    	    play_tone(LA3,QQ);
    	    Delay(1+QQ);
    	    play_tone(LA3,QQ);
    	    Delay(1+QQ);
    	    play_tone(F3,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);

    	    play_tone(LA3,QQ);
    	    Delay(1+QQ);
    	    play_tone(F3,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);
    	    play_tone(LA3,H);
    	    Delay(1+H);

    	    play_tone(E4,QQ);
    	    Delay(1+QQ);
    	    play_tone(E4,QQ);
    	    Delay(1+QQ);
    	    play_tone(E4,QQ);
    	    Delay(1+QQ);
    	    play_tone(F4,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);

    	    play_tone(Ab3,QQ);
    	    Delay(1+QQ);
    	    play_tone(F3,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);
    	    play_tone(LA3,H);
    	    Delay(1+H);

    	    play_tone(LA4,QQ);
    	    Delay(1+QQ);
    	    play_tone(LA3,E+S);
    	    Delay(1+E+S);
    	    play_tone(LA3,S);
    	    Delay(1+S);
    	    play_tone(LA4,QQ);
    	    Delay(1+QQ);
    	    play_tone(Ab4,E+S);
    	    Delay(1+E+S);
    	    play_tone(G4,S);
    	    Delay(1+S);

    	    play_tone(Gb4,S);
    	    Delay(1+S);
    	    play_tone(E4,S);
    	    Delay(1+S);
    	    play_tone(F4,E);
    	    Delay(1+E);
    	    Delay(1+E);//PAUSE
    	    play_tone(Bb3,E);
    	    Delay(1+E);
    	    play_tone(Eb4,QQ);
    	    Delay(1+QQ);
    	    play_tone(D4,E+S);
    	    Delay(1+E+S);
    	    play_tone(Db4,S);
    	    Delay(1+S);

    	    play_tone(C4,S);
    	    Delay(1+S);
    	    play_tone(B3,S);
    	    Delay(1+S);
    	    play_tone(C4,E);
    	    Delay(1+E);
    	    Delay(1+E);//PAUSE QQUASI FINE RIGA
    	    play_tone(F3,E);
    	    Delay(1+E);
    	    play_tone(Ab3,QQ);
    	    Delay(1+QQ);
    	    play_tone(F3,E+S);
    	    Delay(1+E+S);
    	    play_tone(LA3,S);
    	    Delay(1+S);

    	    play_tone(C4,QQ);
    	    Delay(1+QQ);
    	     play_tone(LA3,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);
    	    play_tone(E4,H);
    	    Delay(1+H);

    	     play_tone(LA4,QQ);
    	    Delay(1+QQ);
    	    play_tone(LA3,E+S);
    	    Delay(1+E+S);
    	    play_tone(LA3,S);
    	    Delay(1+S);
    	    play_tone(LA4,QQ);
    	    Delay(1+QQ);
    	    play_tone(Ab4,E+S);
    	    Delay(1+E+S);
    	    play_tone(G4,S);
    	    Delay(1+S);

    	    play_tone(Gb4,S);
    	    Delay(1+S);
    	    play_tone(E4,S);
    	    Delay(1+S);
    	    play_tone(F4,E);
    	    Delay(1+E);
    	    Delay(1+E);//PAUSE
    	    play_tone(Bb3,E);
    	    Delay(1+E);
    	    play_tone(Eb4,QQ);
    	    Delay(1+QQ);
    	    play_tone(D4,E+S);
    	    Delay(1+E+S);
    	    play_tone(Db4,S);
    	    Delay(1+S);

    	    play_tone(C4,S);
    	    Delay(1+S);
    	    play_tone(B3,S);
    	    Delay(1+S);
    	    play_tone(C4,E);
    	    Delay(1+E);
    	    Delay(1+E);
    	    play_tone(F3,E);
    	    Delay(1+E);
    	    play_tone(Ab3,QQ);
    	    Delay(1+QQ);
    	    play_tone(F3,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);

    	    play_tone(LA3,QQ);
    	    Delay(1+QQ);
    	     play_tone(F3,E+S);
    	    Delay(1+E+S);
    	    play_tone(C4,S);
    	    Delay(1+S);
    	    play_tone(LA3,H);
    	    Delay(1+H);

    	    Delay(2*H);

    }



	}



//Port D, Pins 12, 13, 15 y 15 they are Leds
//Port A, Pin 9 is output to the buzzer
void PORT_Init()
	{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);


	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);



	GPIO_InitStructure.GPIO_Pin =	GPIO_Pin_12 |
									GPIO_Pin_13 |
									GPIO_Pin_14 |
									GPIO_Pin_15;

	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;

	GPIO_Init(GPIOD, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin =	GPIO_Pin_9;

		GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
		GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
		GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;

		GPIO_Init(GPIOA, &GPIO_InitStructure);


	}



void Delay(__IO uint32_t nTime)
{
  TimingDelay = nTime;

  while(TimingDelay != 0);
}

void TimingDelay_Decrement(void) // This function is called by SysTick_Handler in stm32f4xx_it.c
{
  if (TimingDelay != 0)
  {
    TimingDelay--;
  }
}

void play_tone(double frecuency, unsigned int duration){

	double period=0;
	double time=0;
	period=(1/frecuency)*10000;

	while(10*duration>time){
	GPIO_SetBits(GPIOD,GPIO_Pin_12);
	GPIO_SetBits(GPIOD,GPIO_Pin_13);
	GPIO_SetBits(GPIOD,GPIO_Pin_14);
	GPIO_SetBits(GPIOD,GPIO_Pin_15);
	GPIO_SetBits(GPIOA,GPIO_Pin_9);
	Delay(period);
	GPIO_ResetBits(GPIOD,GPIO_Pin_12);
	GPIO_ResetBits(GPIOD,GPIO_Pin_13);
	GPIO_ResetBits(GPIOD,GPIO_Pin_14);
	GPIO_ResetBits(GPIOD,GPIO_Pin_15);
	GPIO_ResetBits(GPIOA,GPIO_Pin_9);
	Delay(period);
	time+=2*period;}

}



